services/csm.cloud.pdf.converter/tests/loadtest-jmeter.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.4">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Export PDFs" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">5</stringProp>
        <stringProp name="ThreadGroup.ramp_time">0</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${__BeanShell(${__P(duration,300)}+10)}</stringProp>
        <stringProp name="ThreadGroup.delay">0</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Export PDF" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
    &quot;assignees&quot;: {&#xd;
        &quot;participantIds&quot;: [],&#xd;
        &quot;companyIds&quot;: []&#xd;
    },&#xd;
    &quot;companyIds&quot;: [],&#xd;
    &quot;projectCraftIds&quot;: [],&#xd;
    &quot;from&quot;: &quot;2021-12-20&quot;,&#xd;
    &quot;to&quot;: &quot;2022-04-24&quot;,&#xd;
    &quot;status&quot;: [],&#xd;
    &quot;hasTopics&quot;: null,&#xd;
    &quot;topicCriticality&quot;: [],&#xd;
    &quot;includeDayCards&quot;: true,&#xd;
    &quot;workAreaIds&quot;: [],&#xd;
    &quot;includeMilestones&quot;: true&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">review.bosch-refinemysite.com</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <stringProp name="HTTPSampler.path">/api/v4/projects/7845582f-e262-77b0-e2c6-183d49cca5be/calendar/export</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">content-type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">authorization</stringProp>
                <stringProp name="Header.value">Bearer eyJ0eXAiOiJKV1QiLCJhbGciOiJSUzI1NiIsIng1dCI6IkNFRmpuOUZRLUctLWcyaUZPZDE5RjRpUXhmYyIsImtpZCI6IkNFRmpuOUZRLUctLWcyaUZPZDE5RjRpUXhmYyJ9.eyJpc3MiOiJodHRwczovL3N0YWdlLmlkZW50aXR5LmJvc2NoLmNvbS8iLCJhdWQiOiJodHRwczovL3N0YWdlLmlkZW50aXR5LmJvc2NoLmNvbS9yZXNvdXJjZXMiLCJleHAiOjE2Mzc2ODYxMzIsIm5iZiI6MTYzNzY4MjUzMiwiY2xpZW50X2lkIjoiY2lhbWlkc18zQTVBNDEwMC04Q0E2LTRGRjktOEQwRC1DOEY0NzVGMTVGQzQiLCJzY29wZSI6WyJvcGVuaWQiLCJwcm9maWxlIiwiZW1haWwiXSwic3ViIjoiUy0xLTUtMjEtMzkyMzc0Mjc5NC0zMjQ4MzQxNzk0LTE1ODIwOTA0ODYtMTIxMzUiLCJhdXRoX3RpbWUiOjE2Mzc2Njk4MjUsImlkcCI6ImlkZW50aXR5c2VydmVyIiwiZW1haWwiOiJzbWFydHNpdGVhcHArZGFuaWVsQGdtYWlsLmNvbSIsImp0aSI6IjNhNTM0M2FmZjFiNTVkODhhZDE2MGI1MDI5OWI5NDQwIiwiYW1yIjpbImV4dGVybmFsIl19.IBWVIGztMSLvzdy7wWnt7jt8GRjnTlTZBLK6_AQEpPyCuq5QhT59F_xa44uN4LjETfMjZ6ML3Giz_93HzEOYYLVBV87mYx3AdyK0Mw9QC5mh4LGEOWruX6eZR3yA1Ebl21XLoyBbCjsm3dxsWbx5c7b4trMrMCNG2_JesNHImw4sAQl74UYyGoE_phY2W6gwZTc5TbN7dg3fSJq-UoqTkttdf7eA-vdKtubCB7yR8myK5rv9WZld61b1mbka3ir5BKaOMP4LclZuAR7-OAkOuWZU4oMZnizBfrcuP3LkB4kcAD2KoIqZ9bG4EjmgzAlsjvwOQL5UE77vvY5JAUKFznfthiDsb0GMwCm2bB8wGECL9tSCr2x2orgZ1VaWZV1oqpQ5zyuiW3So9livpCQjTlWKz6IsGUyrP9LwThJOpn06u-ufHS6YhA1PrxSr3TIGqjjfJrJTwhCH0P9Kol_4drYYA8He9PX7xZVXbJib27Rv45K1Ym8b8dQPW_QDMG8SPM_qCB5CCIWYLAcTQMj7zlnyH9EwiVGIG_v77nYoJ_k40BfP2bDdjKDLx9I3fXnbI7HBwwysNM37PM1uKvvn7CHWNRDrr9mGy1gR12MOR5iQqx0N5NIzw1Uhh_eEiyV9RBibmdNDvCVsanNsXqrE6PvmafGOhyE3eI_SDe3sGuI</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">accept</stringProp>
                <stringProp name="Header.value">application/pdf</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
      </hashTree>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="RespTimeGraphVisualizer" testclass="ResultCollector" testname="Response Time Graph" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>